Revit 2026 API
IMultiServerService Methods
The IMultiServerService type exposes the following members.
Methods
Name | Description
CanExecute |  Implement this to test whether a particular server should be executed.
Execute |  Implement this method to execute the given server.
(Inherited from IExternalService)
GetDescription |  Implement this method to return a description of the service.
(Inherited from IExternalService)
GetName |  Implement this method to return the name of the service.
(Inherited from IExternalService)
GetServiceId |  Implement this method to return the unique Id of the service.
(Inherited from IExternalService)
GetVendorId |  Implement this method to return the vendor Id of the service.
(Inherited from IExternalService)
IsValidServer |  Implement this method to check if the given instance represents a valid server of this service.
(Inherited from IExternalService)
OnServersChanged
(Inherited from IExternalService)
OnServersDisparity
(Inherited from IExternalService)
Top
See Also
Reference
IMultiServerService Interface
Autodesk.Revit.DB.ExternalService Namespace